[
    {
        "id": 1,
        "title": "Tests and Testability",
        "content": "In recent years we've pulled back the curtain at Rare, giving you all kinds of insights into the development of current project Sea of Thieves and many of our older classics. As part of this candid new side to our culture, and to give potential new recruits a view of the way we currently do things, we decided there was scope to offer a closer look at some of our specific disciplines and working practices."
    },
    {
        "id": 2,
        "title": "Meta plans to remove thousands of sensitive ad-targeting categories",
        "content": "Ad buyers will no longer be able to use topics such as health, race or sexual orientation to target people with unwanted ads on Facebook or other Meta apps."
    },
    {
        "id": 3,
        "title": "Brazil’s Far-Right Disinformation Pushers Find a Safe Space on Telegram",
        "content": "My first tech blog post!"
    },
    {
        "id": 4,
        "title": "This is the first post!",
        "content": "In a social media ecosystem facing mounting pressure to combat fake news and polarization, Telegram is the most permissive disseminator of content — and disinformation."
    },
    {
        "id": 5,
        "title": "Chip Shortage Creates New Power Players",
        "content": "Low-profile chip makers with aging factories have become surprisingly powerful, leading to industry changes that may outlive the pandemic-fueled supply crunch."
    },
    {
        "id": 6,
        "title": "Satellite Hopes Meet Internet Reality",
        "content": "Satellite internet is exciting, but it needs to be part of a bigger effort to get more people online."
    },
    {
        "id": 7,
        "title": "How to Block Your Phone from Interrupting You",
        "content": "If the apps, alerts and action on your smartphone are taking up too much of your attention, turn on Focus mode to mute the distractions."
    },
    {
        "id": 8,
        "title": "Rivian prices its I.P.O., valuing the electric-vehicle maker at nearly $70 billion.",
        "content": "Rivian and many other automakers are betting that consumers are prepared to rapidly shift to electric vehicles over the next decade."
    }
]